tutorials/fluidSolidInteraction/dbns_explicitGodunov/perpendicularFlap/pimple_explicitGodunov/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel    explicitGodunovCC;;

explicitGodunovCCCoeffs
{
    // Maximum number of momentum correctors
    nCorrectors             10000;

    // Solution tolerance for displacement
    solutionTolerance       1e-4;

    // Relative solution tolerance for displacement in outer FSI iterations
    relConvergenceTolerance 1e-4;

    angularMomentumConservation     no;
    
    incompressiblilityCoefficient   1.0;
    
    dampingCoeff  dampingCoeff [ 0 0 -1 0 0 0 0 ] 0;
    // Write frequency for the residuals
    infoFrequency           100;
}

// ************************************************************************* //
