tutorials/fluidSolidInteraction/dbns_explicitGodunov/perpendicularFlap/pimple_explicitGodunov/0/solid/lmN
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      lmN;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -2 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
   
   interface
   {
         type    zeroGradient;
   }
 
   bottom
   {
        type    fixedValue;
        value   uniform (0 0 0);
   }

   frontAndBack
   {
       type            empty;
   }
}

// ************************************************************************* //
