tutorials/fluidSolidInteraction/dbns_explicitGodunov/perpendicularFlap/pimple_explicitGodunov/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default            backward;
}

ddtSchemes
{
    default            backward;
}

gradSchemes
{
    default            leastSquares;
}

divSchemes
{
    default            Gauss linear;
    numericalFlux
    {
        flux    roe;
    }
}

laplacianSchemes
{
    default            none;
    laplacian(DD,D)    Gauss linear corrected;
    laplacian(DDD,DD)  Gauss linear corrected;
}

snGradSchemes
{
    default            none;
    snGrad(D)          corrected;
    snGrad(DD)         corrected;
}

interpolationSchemes
{
    default            linear;
    interpolate(impK)  linear;
    interpolate(grad(D)) linear;
    interpolate(grad(DD)) linear;
}

// ************************************************************************* //
